app/controllers/pr_events_controller.rb

INSERT INTO `merits` (`username`, `created_at`, `updated_at`, `description`) VALUES ('alex-min', '2016-09-29 13:39:31', '2016-09-29 13:39:31', '[BS]')
---
  def create
    pr_service = GitHub::PullRequestAction.new(params)

    if pr_service.is_pr? && pr_service.state == 'closed'
      comments = GitHub::PullRequestComments.new.fetch(
        [
          pr_service.comments_url,
          pr_service.review_comments_url
        ]
      )
      comment_kudos = GitHub::CommentKudos.new(comments)
      comments_with_kudos = comment_kudos.comments_with_kudos(kudos_character: '🔥 ', author: pr_service.author)
      if comments_with_kudos.present?
        Merit.create!(username: pr_service.author,
                      description: pr_service.title)

SELECT COUNT(*) AS count_all, `merits`.`username` AS merits_username FROM `merits` GROUP BY `merits`.`username`
---
  def index
    @users = Merit.group(:username).count